// ДЗ 3. Виділити число
//   Є вартість у вигляді рядка "$120". Тобто спочатку йде знак валюти, а потім число.
//   Напишіть скрипт, який з такого рядка виділятиме числове значення і повертатиме його.

const sum = '$120';
// const sum = '$120.28gf5'; -- використала як потенційний випадок

const getNum = +sum.slice(1); //має сенс в конкретному випадку, в разі якщо ми маємо десяткове число чи інші символи десь в середині доцільно використати parseInt або parseFloat (за потреби значень після крапки)
const getNum2 = parseInt(sum.slice(1));
const getNum3 = parseFloat(sum.slice(1));

console.log(getNum);
console.log(getNum2);
console.log(getNum3);



